OpenFOAM-2.4.0/tutorials/compressible/sonicFoam/laminar/shockTube/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication setFields
runApplication $application
runApplication foamCalc mag U
runApplication sample

# ----------------------------------------------------------------- end-of-file
